<html>
  <head>
    <title>Pomoc programu Window Detective</title>
    <meta http-equiv="Content-Type" content="text/html; charset=windows-1250" />
    <link rel="stylesheet" type="text/css" href="styles.css" />
  </head>
  <body>
    <div id="header">
      <h2>Wyszukiwanie okien</h2>
    </div>
    <div id="content">
      <p>Jeœli nie mo¿na zlokalizowaæ danego okna na Pulpicie lub na drzewie okien, nale¿y skorzystaæ z funkcji wyszukiwania. Aby otworzyæ okno wyszukiwania, nale¿y klikn¹æ przycisk <img class="icon" src="images/icons/find.png" alt="Ctrl F"/> lub nacisn¹æ klawisze Crtl+F.</p>
      <p>Wyszukiwanie mo¿na przeprowadziæ na dwa sposoby. Wyszukiwanie podstawowe umo¿liwia wyszukanie okna na podstawie jego tytu³u, tekstu lub klasy, natomiast wyszukiwanie zaawansowane umo¿liwia okreœlenie wielu kryteri&oacute;w naraz.</p>
      <h4>Wyszukiwanie podstawowe</h4>
      <p>Karta wyszukiwania podstawowego umo¿liwia wyszukiwanie okien w oparciu o zestaw prostych kryteri&oacute;w.</p>
      <div class="screenshot" align="center">
        <img src="images/find_basic.png" />
        <p>Okno dialogowe wyszukiwania z wybran¹ kart¹ wyszukiwania podstawowego.</p>
      </div>
      <table class="optionlist">
        <tr><td class="option">Tekst</td>
        <td>Ci¹g znak&oacute;w, kt&oacute;ry pojawia siê w tekœcie okna (w przypadku okien wy¿szego poziomu jest to tytu³).<br /> Zaznacz pole &quot;Uwzglêdnij wielkoœæ liter&quot;, aby uwzglêdniæ wielkoœæ liter podczas wyszukiwania.<br /> Zaznacz pole &quot;Wyra¿enia regularne&quot;, aby dopasowaæ tekst wed³ug wyra¿eñ regularnych.<br /> Szablon sk³adni wyra¿eñ regularnych zale¿y od wybranych ustawieñ. PrzejdŸ do tematu <a href="./preferences_general.html#regex">Ustawienia wyra¿eñ regularnych</a>, aby dowiedzieæ siê wiêcej.
        </td></tr>
        <tr><td class="option">Dojœcie</td>
        <td>Dojœcie HWND szukanego okna. Wartoœæ mo¿e mieæ postaæ liczby ca³kowitej zapisanej dziesiêtnie lub szesnastkowo.
        </td><tr>
        <tr><td class="option">Klasa</td>
        <td>Nazwa klasy okna. Pe³ny spis zarejestrowanych klas znajduje siê na liœcie rozwijanej.
        </td></tr>
      </table>
      <h4>Wyszukiwanie zaawansowane</h4>
      <p>Karta wyszukiwania zaawansowanego umo¿liwia wyszukiwanie okien w oparciu o bardziej z³o¿one kryteria. Liczba kryteri&oacute;w nie jest ograniczona. Dostêpne opcje umo¿liwiaj¹ wyszukiwanie wed³ug atrybut&oacute;w okien lub wyszukiwanie na podstawie por&oacute;wnania wybranych wartoœci.</p>
      <div class="screenshot" align="center">
        <img src="images/find_advanced.png" />
        <p>Okno dialogowe wyszukiwania z wybran¹ kart¹ wyszukiwania zaawansowanego.</p>
      </div>
      <table class="optionlist">
        <tr><td class="option">Kryteria</td>
        <td>Lista wszystkich dostêpnych kryteri&oacute;w, na podstawie kt&oacute;rych mo¿na przeprowadziæ wyszukiwanie. Poni¿ej znajduj¹ siê dostêpne kryteria wyszukiwania:
        <table><tr><td><ul>
          <li>Tekst</li>
          <li>Dojœcie</li>
          <li>Klasa okna</li>
          <li>Style</li>
          <li>Style rozszerzone</li>
        </ul></td>
        <td><ul>
          <li>Wartoœæ Unicode</li>
          <li>Nazwa procesu</li>
          <li>ID procesu</li>
          <li>ID w¹tku</li>
        </ul></td></tr></table>
        </td></tr>
        <tr><td class="option">Operator</td>
        <td>Ka¿demu z kryteri&oacute;w odpowiada szereg operator&oacute;w. Zakres dostêpnych operator&oacute;w zale¿y od wybranego kryterium (np. tekst, liczba). Kryteriom tekstowym odpowiadaj¹ operatory &quot;r&oacute;wna siê&quot; (equals), &quot;zawiera&quot; (contains) i &quot;dopasowanie&quot; (matches &mdash; u¿ywane w celu dopasowania z u¿yciem wyra¿eñ regularnych). Kryteriom liczbowym odpowiadaj¹ standardowe operatory, takie jak &quot;r&oacute;wna siê&quot; (equals), &quot;mniejsze ni¿&quot; (less than) itp.
        </td></tr>
        <tr><td class="option">Szukana wartoœæ</td>
        <td>Zawiera szukan¹ wartoœæ. Podobnie jak w przypadku operator&oacute;w, rodzaj wartoœci zale¿y od wybranego kryterium. Mo¿na wprowadziæ tylko tak¹ wartoœæ, kt&oacute;ra odpowiada wybranemu kryterium. Okno lub klasê okna nale¿y wybraæ z listy rozwijanej, kt&oacute;ra zawiera spis wszystkich aktualnie dostêpnych okien i klas.
        </td></tr>
        <tr><td class="option">Powi¹zania logiczne</td>
        <td>Kryteria mo¿na ³¹czyæ ze sob¹ u¿ywaj¹c operator&oacute;w &quot;i&quot; (and) lub &quot;albo&quot; (or). Operator &quot;i&quot; (and) oznacza, ¿e wyszukiwane okno musi spe³niaæ wszystkie wybrane kryteria. Operator &quot;albo&quot; (or) oznacza, ¿e wyszukiwane okno mo¿e spe³niaæ tylko jedno z kryteri&oacute;w. Ka¿de kolejne powi¹zanie bazuje na wyniku poprzedniego powi¹zania. Nie mo¿na wybraæ innej kolejnoœci przeprowadzania operacji. Przyk³ad: Powi¹zanie <tt>A and B or C</tt> jest interpretowane jako <tt>((A and B) or C)</tt>.
        </td></tr>
        <tr><td class="option">Dodaj/Usuñ kryteria</td>
        <td>Dodaje lub usuwa wybrane kryterium. Aby dodaæ nowe kryterium po ju¿ istniej¹cym kryterium, nale¿y klikn¹æ przycisk &quot;Dodaj&quot; znajduj¹cy siê obok ju¿ istniej¹cego kryterium.
        </td></tr>
      </table>
      <h4>Wyszukiwanie</h4>
      <p>Po sprecyzowaniu ¿¹danych kryteri&oacute;w wyszukiwania nale¿y klikn¹æ przycisk &quot;ZnajdŸ&quot;. Zostanie wyœwietlone okno wynik&oacute;w wyszukiwania, zwieraj¹ce spis wszystkich znalezionych okien. Lista znalezionych okien jest wyœwietlana podobnie do listy okien w widoku drzewa.<br /> Mo¿na tak¿e powt&oacute;rzyæ wyszukiwanie, klikaj¹c przycisk &quot;Wyszukaj ponownie&quot; w oknie wynik&oacute;w. Program Window Detective przeprowadzi kolejne wyszukiwanie i wyœwietli zaktualizowan¹ listê wynik&oacute;w. Procedura ta mo¿e okazaæ siê przydatna, jeœli status okien ulegnie zmianie od momentu ostatniego wyszukiwania.</p>
      <div class="screenshot" align="center">
        <img src="images/find_results.png" />
        <p>Okno wynik&oacute;w wyszukiwania z wyœwietlon¹ list¹ wynik&oacute;w wyszukiwania zaawansowanego.</p>
      </div>
    </div>
  </body>
</html>